content-org/o.org
:PROPERTIES:
:EXPORT_DATE: [2018-11-11 Mon 21:49]
:END:

* Food/Drinks
:PROPERTIES:
:EXPORT_FILE_NAME: food_drinks
:EXPORT_HUGO_SECTION: docs/collections
:END:
** 🍹 Drinks I enjoy (ranked)
I am super non-fancy.
- Amla Juice (rare)
- Lime juice (sweet)
- ORS Liquid (Orange flavour)
- Kingfisher Ultra
- Banana shake
- Kingfisher Premium
- Electral Powder drink during summers 💏
** 🍸 Cocktail recipes
none yet but check [[https://github.com/balevine/cocktails][this]]
** 🍲 Food recipes
none yet
*** Resources
- [[https://www.reciperadar.com/][RecipeRadar - search recipes by ingredients]]
- [[https://www.eatbydate.com/][How Long Does Food Last? Guide to Shelf Life & Expiration]]
- [[https://shouldibake.com/][Should I Bake?]]
- [[https://medievalcookery.com/][Medieval Cookery]]
- [[https://headbangerskitchen.com/?s=35][Headbanger's Kitchen - Keto All The Way!]]
- [[http://www.cookingforengineers.com/][Cooking For Engineers]]
- [[http://www.gardening.cornell.edu/homegardening/][Explore Cornell - Home Gardening - Introduction]]
- [[https://www.funfoodfrolic.com/][Home - Fun FOOD Frolic]] (Nice indian foods i think, have to check properly, like the jar salad thing)
** 🏃 Places
Recommendations of different places in different places.
- [[https://www.google.com/maps/d/edit?mid=1QvCvZS2U1sv3ADrnOhIXKz7OCxrYU3h2&usp=sharing][Pondicherry and Auroville]]
- Guwahati
- Bangalore
- Shillong

** 🏋 Exercise Plan
I am [[https://exrx.net/][simply]] [[https://liamrosen.com/fitness.html][following]] the [[https://www.hybridcalisthenics.com/programs][Hybrid Routine 2.0]] by Hampton.
*** Common things
Following is directly copy pasted from [[https://www.hybridcalisthenics.com/programs][Hybrid Calisthenics]], use this [[https://www.reddit.com/r/bodyweightfitness/comments/cnzs21/confused_by_all_the_fitness_terms_i_wrote_up_a/][glossary from /r/bodyweightfitness]] to understand technical terms better.
- **Strength**
  - To get stronger, we must progressively challenge ourselves with harder exercises.
  - The more often we ask our muscles to contract near their maximum voluntary capacity, the stronger we get.
  - Therefore, pure strength programs will focus on:
    - high set volume
    - low rep volume
    - high resistance
  - This way, the individual can pour as much strength into each rep as possible.
- **Muscle**
  - To get more muscular, we must fatigue our muscles.
  - When we bring our muscles near failure, this triggers a growth response.
  - It’s interesting to note that science doesn’t fully understand exactly how hypertrophy (muscle growth) functions. We just know that it does based on empirical data.
  - Although resistance doesn’t necessarily need to be as high as it’d be in a pure strength program, enough resistance must be present to activate and fatigue our type-2 muscle fibers. They have the most potential for growth!
    - low set volume
    - high rep volume
    - moderate-high resistance.
- **Fat Loss**
  - This has more to do with our diet than our workout program.
  - To lose weight, our caloric intake must be lower than our caloric output.
  - A good overall training program will help you burn more calories, optimize your hormones, and increase functionality.
  - However, if you’re training hard and not losing as much fat as you’d like, you may need to adjust your diet.
- **Stamina**
  - Although often used interchangeably with “cardio,” building our muscular stamina can be a separate pursuit.
  - Our endurance is somewhat activity-dependent. For example, being able to do high-repetition pushups does not mean we will be able to do high-repetition squats.
  - Many programs can be used for muscular endurance, but these usually involve high set volume, medium rep volume, and medium resistance.
  - If you just want to feel your heart pumping, high repetition squats or bridges will do the trick. You can also explore things like hill sprints.


** 🥘 Diet Plan
#+attr_html: :class book-hint info small-text
#+begin_quote
- 26 / Male / 165cm / 42kg / 10%fat / 1424kcal / 15.4 BMI(Underweight)
- See [[https://tdeecalculator.net/result.php?s=metric&age=26&g=male&cm=165&kg=42&act=1.2&bf=10&f=1][calculation here]], I use [[https://www.nutritionix.com/][nutritionix]] for food-tracking.
  - Previously, I tried HealthifyMe, MyFitnessPal, Cronometer, Lifesum and Waistline. All of them had their own issues, the nutritionix app has good database for indian food and a decent UI that I can tolerate on a daily.
- Goal kcal: 2100 ([[https://www.reddit.com/r/gainit/wiki/index][1424+676]])
- Goal weight: 63kg (Sept'23)
- Recommended micronutrient %: Carbs(40%), Protein(28%), Fat(32%) (Bulking, Beefcake)
- Others: allergic to milk, lactose intolerant
- Start date: 15th Nov'22
#+end_quote
You can’t fight a problem when you don’t understand it. So understand what you're getting inside your body. If you want to improve, you should have a visceral level of disgust against your bad eating patterns([[https://letsharden.substack.com/p/are-ya-eating-good-son][h/t ankit]]). Work out and eat at the same times every day. this helps instill discipline and trains your body faster. I also want to explore some [[https://news.ycombinator.com/item?id=38109778][biohacking]] stuff.
*** Nutrition
**** Calories
- A calorie is a unit of energy. The traditional calorie is equal to about 4.2 joules
- The calorie you see listed on food packaging is actually a kilocalorie, or 1000 calories, so it's equal to about 4200 joules.
- When a food item has a measurement of calories, it's saying /"this is how much energy this food item will give your body."/.
  - But that's not entirely true because it's the amount of energy in the food, not what your body can get from it.
  - Additionally, cooking sort of changes the calorie you get out of the food.
#+attr_html: :class book-hint info small-text
#+begin_quote
- First you add other ingredients to the food while cooking
- Secondly cooking partially breaks down the food making it easier to extract the calories of the food. So since you use less energy to get the energy from the food you net more calories. Extreme examples of this is eating beans uncooked which results in your body getting nothing out of it. They're designed to not be digested. Even if you chew them thoroughly, they're filled with chemicals whose only purpose is to stop you from getting any nutrition from them(antinutrients). Boiling them fortunately destroys these chemicals so that we can access all that nutrition.
#+end_quote

- When you say you're burning calories, you are literally converting them into co2, heat, and water like when you burn wood, just at much lower temperatures.
**** Types of calories
There are four types of calories. The first three are necessary for human health, but the last (alcohol) is not. Each individual food item is usually made up of a combination of these. For example, an egg has both protein and fat.
- **Proteins**
  - These are the building blocks for your muscles and body.
  - If you are working out, you want to have plenty of proteins to build up your muscles. That’s why body builders always use protein shakes.
  - However, proteins turn to fat by the liver if you consume too much of it (or you are not working out) and if your body doesn't use them.
  - =1g of protein = 4kcal=
- **Carbohydrates (or Carbs)**
  - These are the energy source for your activity.
  - Take Carbohydrates before intense activity like running or gym sessions.
  - If Carbohydrates are not "burned" during the activity following your meal, it will be stored as fat.
  - =1g of carbs = 4kcal=
#+attr_html: :class book-hint info small-text
#+begin_quote
*More about carbs*
- Carbs are a family(saccharides) that contains sugar but also complex carbs and fiber.
- The most important statistic for your health about a type of carbohydrate is the Glysymic Index (GI). The GI will tell us how fast that type of carb is absorbed by the body. The faster the absorption rate the higher the spike in blood sugar.
- Carbohydrates can be broadly divided into 3 groups: simple carbs, complex carbs, and fiber.
  - *Simple carbs*: These are mono- and disaccharides such as table sugar (sucrose which is =glucose + fructose=). These are absorbed quickly by and cause a rapid spike in your blood sugar which results in a rapid spike in insulin levels. (Bagged Sugar, Fruit Juice, Honey, Cake, Soda, etc)
  - *Complex carbs*: These are longer chain polysaccharides (literally =many glucoses chained together=) which take longer for your body to digest. This leads to a slow and steady increase in blood sugar and a slow and steady increase in insulin levels which can be well managed by your body. (Oatmeal, Beans, most Veg.)
  - *Fiber*: This is an insoluble form of carbohydrates that our bodies cannot process. Since it cannot be processed, it will never be absorbed or used as energy and will pass through. But it does play an important role as it helps keep hunger and blood sugar in check.

#+end_quote
- **Fat**
  - This, sometimes labeled as lipids will remain fat in your body.
  - It will eventually be used for fuel when you engage in an intense exercise routine.
  - A minimum fat intake is necessary to keep your body and organs functioning.
  - Normally you don’t really want too many calories from fat.
  - =1g of fat = 9kcal=
- *Alcohol*
  - =1g of fat = 7kcal=
**** Hormones
- =Insulin= is released by our pancreas to help the cells in our muscles and our brains to accept the incoming sugar molecules from the food, regulates blood sugar.
- =Leptin= is released by out body when we have eaten enough food to go work i.e when we are full. If =Leptin= is not released you'll keep feeling hungry.
- =Ghrelin= signals your brain when your stomach is empty and it’s time to eat. =Leptin= decreases your appetite, while =ghrelin= increases it.
*** Weight gain
Some notes paraphrased/copied from the internet. Please don't take these as advice.
- Eating more is the only way you can gain weight.
- If I am not gaining weight, I am not eating enough and not reaching a calorie surplus.
- No matter what my food logging app says, if I am not gaining weight, it means I am not eating enough, I should eat more.
- Track trends over months/weeks instead of daily, body weight keep fluctuating on a daily.
- Your calories has to be reflect your volume and your goals. Getting bigger is no different than getting stronger or becoming a better athlete in terms of principles. You eat for performance. And if your “performance” is getting bigger (more muscle mass) than you have to eat enough food to illicit recovery and to give your body fuel.
*** On lactose
=Lactose intolerance= is a very common digestive problem. Those who have it don’t have enough of an enzyme called lactase, found in the gut. Lactase is needed to break down lactose, the main sugar found in milk.

After 23 years of living, I realized that my body does not play well with milk. Conventionally, in our family milk is the poster boy of a healthy diet. Now that I know better, I try to avoid milk. Here are few tips for myself.
- Basically go for lactose free products.
- Paneer is a better substitute than milk for the lactose intolerant person. If Paneer is a block, break/crush the union and wash it with water and squeeze out the water. Several washing should reduce lactose.
- Yogurt gives you the same nutrition as milk without being too acidic. milk is good but not in excessive amounts. Most yogurts contain live bacteria that can help break down lactose, so your body has less to process on its own.
- If I ever consume whey protein, make sure to get the low-lactose protein powders.
*** Pantry goodness
#+attr_html: :class book-hint warning small-text
#+begin_quote
I did not section the following into breakfast, lunch, snacks etc. as the food tracking app I use does that already. Instead I keep this list for my convenience because I get very confused about what should I eat at any given time, which is why I sometimes end up not eating anything when nobody around me is there to suggest eating something.

These food/ingredients are accessible to me or I can cook them kind of.
This is like my menu to my own resturant which is my kitchen.
This is not a recommendation at all.
#+end_quote
- *Hot Drinks*: Black tea, Black coffee, Chicken soup
- *Cold Drinks*: Lemonade
- *Lite snack*: Omelette with butter and vegetables
- *Heavy snack*: Oatmeal with milk and nuts, Bowl of pasta and marinara sauce, Khichdi
- *Fresh fruits*
  - Banana, Apple, Tomato
  - They give you the much needed fiber and help your body extract nutrients better.
- *Dry fruits*: Kishmish, Khajur, Kaju, Peanut, Almond
- *[[https://pipingpotcurry.com/indian-pulses/][Legums]]*: Chickpea, Peas, Rajma, Moong Dal, Masoor Dal
- *Diary products*
  - Chicken, Egg, Butter, Ghee, Paneer
  - Meat gives you lot of protein but woefully lacks in fiber.
- *Oil*: Olives
- *Salad*: Sprout salad, Fruit salad
- *Bread*: Chapati, Aloo Paratha, Brown Bread
- *Seed*: Brown rice
- *Fresh vegetables*
  - Sweet potato, Potato, Carrot, Cabbage
  - They give you the much needed fiber and help your body extract nutrients better.
- *Add-ons*: Peanut Butter, Dark chocolate, Multivitamin tabs

